app/views/country/show.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = ? AND "reviews"."country_id" = 116 LIMIT 1  [["user_id", 1]]
---
      <a data-role="button" data-inline="true" data-icon="edit"  data-iconpos="right"
        <% if !@user.reviews.where("country_id is ?", @country.id).take.nil? %>