app/controllers/country_controller.rb

  def change
    countryName = params[:countryName]
    country = Country.where(name: countryName).take
---
SELECT "countries".* FROM "countries" WHERE "countries"."name" = 'Russia' LIMIT 1

  def show

    @country = Country.where(id: params[:id]).take
---
SELECT "countries".* FROM "countries" WHERE "countries"."id" = 3 LIMIT 1