app/controllers/messages_controller.rb

SELECT "messages".* FROM "messages" WHERE "messages"."id" = 1 LIMIT 1
UPDATE "messages" SET "viewed" = ?, "updated_at" = ? WHERE "messages"."id" = 1  [["viewed", true], ["updated_at", Sun, 23 Nov 2014 22:11:01 UTC +00:00]]
---
def show
  @message = Message.where(id: params[:id]).take

  if @user.nil? || @message.nil?
    redirect_to root_path
  elsif (@user != @message.receiver && @user != @message.sender)
    redirect_to user_messages_path(user_id: @user.id)
  else
    if @user == @message.receiver
      @message.update(viewed: true)

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
def new
  @receiver = User.where("id = ?", params[:user_id]).take

INSERT INTO "messages" ("body", "created_at", "receiver_id", "sender_id", "title", "updated_at", "viewed") VALUES (?, ?, ?, ?, ?, ?, ?)
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
def create
  title = params[:message][:title]
  body = params[:message][:body]
  receiverId = params[:user_id]
  senderId = @user.id

  @message = Message.new(sender_id: senderId, receiver_id: receiverId, title: title, body: body, viewed: false)

  if @message.save
    redirect_to user_message_path(user_id: senderId, id: @message.id)
  else
    @receiver = User.find(receiverId)