app/controllers/reviews_controller.rb

def show
  @review = Review.where(id: params[:id]).take

  if @review
    @author = @review.user
    @country = Country.find(params[:country_id])

    if !@user.nil?
      reviewLog = @user.review_logs.where(review_id: params[:id]).take
      if reviewLog
        reviewLog.update(seen: true)
      else
        ReviewLog.create review_id: @review.id, user_id: @user.id, seen: true, rating: 0
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = 1 LIMIT 1
SELECT "countries".* FROM "countries" WHERE "countries"."id" = ? ORDER BY "countries"."id" ASC LIMIT 1  [["id", 116]]
SELECT "review_logs".* FROM "review_logs" WHERE "review_logs"."user_id" = ? AND "review_logs"."review_id" = 1 LIMIT 1  [["user_id", 1]]
INSERT INTO "review_logs" ("created_at", "rating", "review_id", "seen", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Sun, 23 Nov 2014 22:10:33 UTC +00:00], ["rating", 0], ["review_id", 1], ["seen", true], ["updated_at", Sun, 23 Nov 2014 22:10:33 UTC +00:00], ["user_id", 1]]

def new
  if @user.nil?
    redirect_to country_path(id: params[:country_id])
  else
    @country = Country.find(params[:country_id])
    review = Review.where(user_id: @user.id, country_id: @country.id).take
---
SELECT "countries".* FROM "countries" WHERE "countries"."id" = ? LIMIT 1  [["id", "116"]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = 1 AND "reviews"."country_id" = 116 LIMIT 1

def create
  title = params[:review][:title]
  body = params[:review][:body]
  countryId = params[:country_id]
  userId = @user.id
  review = Review.where(user_id: userId, country_id: countryId).take

  if !review.nil?
    flash[:notice] = 'You already wrote a review for this country.'
    redirect_to country_review_path(id: review.id)

  else
    @review = Review.new(user_id: userId, title: title, body: body, country_id: countryId)

    if @review.save
      redirect_to country_review_path(id:@review.id)
    else
      @country = Country.find(countryId)
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = 1 AND "reviews"."country_id" = 116 LIMIT 1
INSERT INTO "reviews" ("body", "country_id", "created_at", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)
SELECT "countries".* FROM "countries" WHERE "countries"."id" = ? LIMIT 1  [["id", "116"]]

def like
  if !@user.nil?
    reviewLog = @user.review_logs.where(review_id: params[:id]).take
    if reviewLog
      reviewLog.update(rating: params[:like])
---
SELECT "review_logs".* FROM "review_logs" WHERE "review_logs"."user_id" = ? AND "review_logs"."review_id" = 1 LIMIT 1  [["user_id", 2]]
UPDATE "review_logs" SET "rating" = ?, "updated_at" = ? WHERE "review_logs"."id" = 2  [["rating", 1], ["updated_at", Sun, 23 Nov 2014 22:13:20 UTC +00:00]]