app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]
---
  def show
    @userProfile = User.where(id: params[:id]).take

SELECT "users".* FROM "users" WHERE "users"."name" = 'Fabba' LIMIT 1
---
  def register
    if params[:password] == params[:confirmpassword]
      if User.where(:name => params[:username]).take.nil?

SELECT "users".* FROM "users" WHERE (name like '%Fabba%')
---
  def search
    @users = User.search(params[:query])