app/controllers/welcome_controller.rb

SELECT "countries".* FROM "countries"
---
  def index
    countries = Country.all